data-asplos/themis-conf-gramine/lighttpd-100.txt
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.42ms    2.56ms  91.51ms   95.27%
    Req/Sec     2.15k   153.58     4.73k    68.24%
  3084217 requests in 2.00m, 0.91GB read
  Socket errors: connect 0, read 6, write 0, timeout 0
Requests/sec:  25688.04
Transfer/sec:      7.72MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.26ms    2.45ms  40.97ms   94.12%
    Req/Sec     2.04k   125.80     2.63k    74.69%
  2921571 requests in 2.00m, 0.86GB read
Requests/sec:  24335.39
Transfer/sec:      7.31MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.59ms    2.39ms 242.37ms   94.47%
    Req/Sec     2.00k   100.25     4.28k    73.42%
  2864058 requests in 2.00m, 860.89MB read
  Socket errors: connect 0, read 5, write 0, timeout 0
Requests/sec:  23855.27
Transfer/sec:      7.17MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.59ms    2.46ms  41.54ms   94.32%
    Req/Sec     2.00k   103.77     2.90k    76.94%
  2864540 requests in 2.00m, 861.04MB read
Requests/sec:  23859.25
Transfer/sec:      7.17MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.52ms    2.44ms  41.07ms   93.82%
    Req/Sec     2.01k   106.62     3.48k    77.95%
  2878402 requests in 2.00m, 865.20MB read
Requests/sec:  23967.25
Transfer/sec:      7.20MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.13ms    2.42ms  41.15ms   94.58%
    Req/Sec     2.06k   129.48     3.00k    74.41%
  2945946 requests in 2.00m, 0.86GB read
Requests/sec:  24539.91
Transfer/sec:      7.38MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.38ms    2.33ms  59.02ms   95.05%
    Req/Sec     2.15k   134.77     4.14k    59.51%
  3089435 requests in 2.00m, 0.91GB read
  Socket errors: connect 0, read 50, write 0, timeout 0
Requests/sec:  25732.01
Transfer/sec:      7.73MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.02ms    2.19ms  34.23ms   95.42%
    Req/Sec     2.21k   104.17     4.38k    74.93%
  3164543 requests in 2.00m, 0.93GB read
  Socket errors: connect 0, read 2, write 0, timeout 0
Requests/sec:  26352.51
Transfer/sec:      7.92MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.01ms    2.25ms  33.92ms   95.16%
    Req/Sec     2.21k   122.26     9.31k    78.01%
  3165507 requests in 2.00m, 0.93GB read
Requests/sec:  26358.83
Transfer/sec:      7.92MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.03ms    2.26ms 116.96ms   95.05%
    Req/Sec     2.20k   107.80     4.86k    80.03%
  3160415 requests in 2.00m, 0.93GB read
  Socket errors: connect 0, read 58, write 0, timeout 0
Requests/sec:  26315.78
Transfer/sec:      7.91MB